Revit 2024 API
TextElement.KeepRotatedTextReadable Property
 A flag to control how text behaves inside a rotated text element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool KeepRotatedTextReadable { get; set; }
Visual Basic
Public Property KeepRotatedTextReadable As Boolean
	Get
	Set
Visual C++
public:
property bool KeepRotatedTextReadable {
	bool get ();
	void set (bool value);
}
Remarks
If the property is True then the text inside the text box gets oriented so it is readable when looking straight up at the sheet or from its right side; in other words, the text would never be upside down.
If the value is False, however, the text's orientation strictly follows the rotation of the text box, which means the text may be upside down when viewed on screen or printed on a sheet.
See Also
TextElement Class
Autodesk.Revit.DB Namespace